In [1]:
import pandas as pd

In [9]:
df = pd.read_csv('stock_data_tidy.csv')

In [10]:
df.head()

         date        AMZN        GOOG         FB       BABA     JD
0   9/15/2014  331.320007  594.447937  77.910004  93.889999  28.35
1   9/22/2014  323.209991  575.519897  78.790001  90.459999  26.93
2   9/29/2014  322.739990  573.704895  77.440002  88.099998  25.98
3   10/6/2014  311.390015  542.999207  72.910004  85.879997  25.01
4  10/13/2014  303.640015  509.770416  75.949997  87.910004  25.07

In [13]:
df_melt = pd.melt(df, id_vars=['date'], value_vars=['AMZN', 'GOOG', 'FB', 'BABA', 'JD'])

In [19]:
df_melt.tail(500)

           date variable       value
1065  2/13/2017     BABA  100.519997
1066  2/20/2017     BABA  102.949997
1067  2/27/2017     BABA  103.309998
1068   3/6/2017     BABA  103.389999
1069  3/13/2017     BABA  105.610001
...         ...      ...         ...
1560  8/10/2020       JD   62.060001
1561  8/17/2020       JD   74.980003
1562  8/24/2020       JD   79.959999
1563  8/31/2020       JD   80.000000
1564   9/7/2020       JD   76.220001

[500 rows x 3 columns]

In [20]:
df_melt.to_csv('stock_data_tidy.csv')